results/out/aleph-epoll.ring-interceptors.async.java15.ShenandoahGC.r20k.t16.c400.d600s.out
Running 10m test @ http://localhost:9999/math/plus?x=1&y=2
  16 threads and 400 connections
  Thread calibration: mean lat.: 1.685ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.754ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.589ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.677ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.685ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.661ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.672ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.538ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.474ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.543ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.547ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.352ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.567ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.568ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.368ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.464ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.34ms    1.63ms  58.72ms   96.74%
    Req/Sec     1.32k   654.78     4.10k    57.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    1.52ms
 90.000%    1.98ms
 99.000%    8.66ms
 99.900%   21.81ms
 99.990%   36.10ms
 99.999%   46.97ms
100.000%   58.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.082     0.000000            1         1.00
       0.451     0.100000      1183727         1.11
       0.656     0.200000      2362939         1.25
       0.820     0.300000      3539661         1.43
       0.966     0.400000      4724580         1.67
       1.103     0.500000      5904698         2.00
       1.171     0.550000      6494905         2.22
       1.242     0.600000      7078753         2.50
       1.323     0.650000      7670982         2.86
       1.415     0.700000      8262708         3.33
       1.521     0.750000      8852965         4.00
       1.579     0.775000      9144456         4.44
       1.641     0.800000      9438805         5.00
       1.708     0.825000      9734121         5.71
       1.782     0.850000     10028543         6.67
       1.871     0.875000     10325675         8.00
       1.923     0.887500     10471876         8.89
       1.984     0.900000     10619529        10.00
       2.057     0.912500     10765334        11.43
       2.153     0.925000     10914110        13.33
       2.283     0.937500     11061957        16.00
       2.365     0.943750     11135071        17.78
       2.463     0.950000     11208688        20.00
       2.585     0.956250     11281565        22.86
       2.765     0.962500     11355506        26.67
       3.051     0.968750     11429065        32.00
       3.281     0.971875     11465788        35.56
       3.673     0.975000     11502647        40.00
       4.291     0.978125     11539570        45.71
       5.251     0.981250     11576428        53.33
       6.459     0.984375     11613207        64.00
       7.131     0.985938     11631691        71.11
       7.787     0.987500     11650085        80.00
       8.295     0.989062     11668564        91.43
       8.999     0.990625     11686993       106.67
       9.943     0.992188     11705386       128.00
      10.479     0.992969     11714675       142.22
      11.095     0.993750     11723848       160.00
      11.735     0.994531     11733054       182.86
      12.247     0.995313     11742384       213.33
      13.031     0.996094     11751486       256.00
      13.655     0.996484     11756082       284.44
      14.383     0.996875     11760664       320.00
      15.199     0.997266     11765274       365.71
      16.071     0.997656     11769893       426.67
      17.183     0.998047     11774507       512.00
      17.903     0.998242     11776807       568.89
      18.703     0.998437     11779095       640.00
      19.583     0.998633     11781429       731.43
      20.607     0.998828     11783717       853.33
      21.983     0.999023     11786009      1024.00
      22.703     0.999121     11787166      1137.78
      23.455     0.999219     11788308      1280.00
      24.335     0.999316     11789465      1462.86
      25.423     0.999414     11790617      1706.67
      26.671     0.999512     11791773      2048.00
      27.391     0.999561     11792351      2275.56
      28.143     0.999609     11792917      2560.00
      28.959     0.999658     11793491      2925.71
      29.951     0.999707     11794071      3413.33
      30.975     0.999756     11794648      4096.00
      31.567     0.999780     11794937      4551.11
      32.287     0.999805     11795222      5120.00
      33.151     0.999829     11795511      5851.43
      34.015     0.999854     11795799      6826.67
      35.039     0.999878     11796088      8192.00
      35.583     0.999890     11796226      9102.22
      36.191     0.999902     11796374     10240.00
      36.863     0.999915     11796515     11702.86
      37.727     0.999927     11796660     13653.33
      38.815     0.999939     11796803     16384.00
      39.455     0.999945     11796874     18204.44
      40.031     0.999951     11796946     20480.00
      40.671     0.999957     11797018     23405.71
      41.631     0.999963     11797092     27306.67
      42.687     0.999969     11797163     32768.00
      43.135     0.999973     11797198     36408.89
      43.647     0.999976     11797236     40960.00
      44.255     0.999979     11797271     46811.43
      44.895     0.999982     11797308     54613.33
      45.759     0.999985     11797342     65536.00
      46.047     0.999986     11797361     72817.78
      46.399     0.999988     11797379     81920.00
      46.687     0.999989     11797396     93622.86
      47.295     0.999991     11797414    109226.67
      48.319     0.999992     11797432    131072.00
      48.479     0.999993     11797442    145635.56
      48.831     0.999994     11797451    163840.00
      49.279     0.999995     11797460    187245.71
      50.079     0.999995     11797469    218453.33
      50.687     0.999996     11797477    262144.00
      50.911     0.999997     11797482    291271.11
      51.775     0.999997     11797486    327680.00
      52.255     0.999997     11797491    374491.43
      52.831     0.999998     11797495    436906.67
      53.727     0.999998     11797500    524288.00
      53.951     0.999998     11797502    582542.22
      54.015     0.999998     11797505    655360.00
      54.335     0.999999     11797507    748982.86
      54.847     0.999999     11797509    873813.33
      55.455     0.999999     11797511   1048576.00
      55.583     0.999999     11797512   1165084.44
      56.255     0.999999     11797513   1310720.00
      56.639     0.999999     11797515   1497965.71
      56.991     0.999999     11797516   1747626.67
      57.311     1.000000     11797517   2097152.00
      57.311     1.000000     11797517   2330168.89
      57.471     1.000000     11797518   2621440.00
      57.535     1.000000     11797519   2995931.43
      57.535     1.000000     11797519   3495253.33
      57.599     1.000000     11797520   4194304.00
      57.599     1.000000     11797520   4660337.78
      57.599     1.000000     11797520   5242880.00
      57.791     1.000000     11797521   5991862.86
      57.791     1.000000     11797521   6990506.67
      57.791     1.000000     11797521   8388608.00
      57.791     1.000000     11797521   9320675.55
      57.791     1.000000     11797521  10485760.00
      58.751     1.000000     11797522  11983725.71
      58.751     1.000000     11797522          inf
#[Mean    =        1.344, StdDeviation   =        1.629]
#[Max     =       58.720, Total count    =     11797522]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11997499 requests in 10.00m, 2.00GB read
Requests/sec:  19995.81
Transfer/sec:      3.41MB